fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28.cpp

/***************************************************************************
 *  rx28.cpp - Controller for Visca cams
 *
 *  Created: Tue Jun 16 11:09:32 2009 (based on visca.cpp)
 *  Copyright  2005-2009  Tim Niemueller [www.niemueller.de]
 *
 ****************************************************************************/

/*  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version. A runtime exception applies to
 *  this software (see LICENSE.GPL_WRE file mentioned below for details).
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU Library General Public License for more details.
 *
 *  Read the full text in the LICENSE.GPL_WRE file in the doc directory.
 */

#include "rx28.h"

#include <core/exceptions/system.h>
#include <core/exceptions/software.h>

#include <utils/math/angle.h>

#include <sys/ioctl.h>
#include <stdio.h>
#include <sys/time.h>
#include <termios.h>
#include <fcntl.h>
#include <errno.h>
#include <unistd.h>
#include <cstring>
#include <cstdlib>
#include <cstdarg>

const unsigned char RobotisRX28::BROADCAST_ID             = 0xfe; /**< BROADCAST_ID */
const unsigned int  RobotisRX28::MAX_POSITION             = 0x3ff; /**< MAX_POSITION */
const unsigned int  RobotisRX28::CENTER_POSITION          = 0x1ff; /**< CENTER_POSITION */
const unsigned int  RobotisRX28::MAX_SPEED                = 0x3ff; /**< MAX_SPEED */
const float         RobotisRX28::MAX_ANGLE_DEG            = 300; /**< MAX_ANGLE_DEG */
const float         RobotisRX28::MAX_ANGLE_RAD            = fawkes::deg2rad(RobotisRX28::MAX_ANGLE_DEG); /**< MAX_ANGLE_RAD */
const float         RobotisRX28::RAD_PER_POS_TICK         = RobotisRX28::MAX_ANGLE_RAD / (float)(RobotisRX28::MAX_POSITION); /**< RAD_PER_POS_TICK */
const float         RobotisRX28::POS_TICKS_PER_RAD        = (float)(RobotisRX28::MAX_POSITION) / RobotisRX28::MAX_ANGLE_RAD; /**< POS_TICKS_PER_RAD */
const float         RobotisRX28::SEC_PER_60DEG_12V        = 0.167; /**< SEC_PER_60DEG_12V */
const float         RobotisRX28::SEC_PER_60DEG_16V        = 0.126; /**< SEC_PER_60DEG_16V */

const unsigned char RobotisRX28::SRL_RESPOND_NONE         =  0; /**< SRL_RESPOND_NONE */
const unsigned char RobotisRX28::SRL_RESPOND_READ         =  1; /**< SRL_RESPOND_READ */
const unsigned char RobotisRX28::SRL_RESPOND_ALL          =  2; /**< SRL_RESPOND_ALL */

const unsigned char RobotisRX28::P_MODEL_NUMBER_L         =  0; /**< P_MODEL_NUMBER_L */
const unsigned char RobotisRX28::P_MODEL_NUMBER_H         =  1; /**< P_MODEL_NUMBER_H */
const unsigned char RobotisRX28::P_VERSION                =  2; /**< P_VERSION */
const unsigned char RobotisRX28::P_ID                     =  3; /**< P_ID */
const unsigned char RobotisRX28::P_BAUD_RATE              =  4; /**< P_BAUD_RATE */
const unsigned char RobotisRX28::P_RETURN_DELAY_TIME      =  5; /**< P_RETURN_DELAY_TIME */
const unsigned char RobotisRX28::P_CW_ANGLE_LIMIT_L       =  6; /**< P_CW_ANGLE_LIMIT_L */
const unsigned char RobotisRX28::P_CW_ANGLE_LIMIT_H       =  7; /**< P_CW_ANGLE_LIMIT_H */
const unsigned char RobotisRX28::P_CCW_ANGLE_LIMIT_L      =  8; /**< P_CCW_ANGLE_LIMIT_L */
const unsigned char RobotisRX28::P_CCW_ANGLE_LIMIT_H      =  9; /**< P_CCW_ANGLE_LIMIT_H */
const unsigned char RobotisRX28::P_SYSTEM_DATA2           = 10; /**< P_SYSTEM_DATA2 */
const unsigned char RobotisRX28::P_LIMIT_TEMPERATURE      = 11; /**< P_LIMIT_TEMPERATURE */
const unsigned char RobotisRX28::P_DOWN_LIMIT_VOLTAGE     = 12; /**< P_DOWN_LIMIT_VOLTAGE */
const unsigned char RobotisRX28::P_UP_LIMIT_VOLTAGE       = 13; /**< P_UP_LIMIT_VOLTAGE */
const unsigned char RobotisRX28::P_MAX_TORQUE_L           = 14; /**< P_MAX_TORQUE_L */
const unsigned char RobotisRX28::P_MAX_TORQUE_H           = 15; /**< P_MAX_TORQUE_H */
const unsigned char RobotisRX28::P_RETURN_LEVEL           = 16; /**< P_RETURN_LEVEL */
const unsigned char RobotisRX28::P_ALARM_LED              = 17; /**< P_ALARM_LED */
const unsigned char RobotisRX28::P_ALARM_SHUTDOWN         = 18; /**< P_ALARM_SHUTDOWN */
const unsigned char RobotisRX28::P_OPERATING_MODE         = 19; /**< P_OPERATING_MODE */
const unsigned char RobotisRX28::P_DOWN_CALIBRATION_L     = 20; /**< P_DOWN_CALIBRATION_L */
const unsigned char RobotisRX28::P_DOWN_CALIBRATION_H     = 21; /**< P_DOWN_CALIBRATION_H */
const unsigned char RobotisRX28::P_UP_CALIBRATION_L       = 22; /**< P_UP_CALIBRATION_L */
const unsigned char RobotisRX28::P_UP_CALIBRATION_H       = 23; /**< P_UP_CALIBRATION_H */

const unsigned char RobotisRX28::P_TORQUE_ENABLE          = 24; /**< P_TORQUE_ENABLE */
const unsigned char RobotisRX28::P_LED                    = 25; /**< P_LED */
const unsigned char RobotisRX28::P_CW_COMPLIANCE_MARGIN   = 26; /**< P_CW_COMPLIANCE_MARGIN */
const unsigned char RobotisRX28::P_CCW_COMPLIANCE_MARGIN  = 27; /**< P_CCW_COMPLIANCE_MARGIN */
const unsigned char RobotisRX28::P_CW_COMPLIANCE_SLOPE    = 28; /**< P_CW_COMPLIANCE_SLOPE */
const unsigned char RobotisRX28::P_CCW_COMPLIANCE_SLOPE   = 29; /**< P_CCW_COMPLIANCE_SLOPE */
const unsigned char RobotisRX28::P_GOAL_POSITION_L        = 30; /**< P_GOAL_POSITION_L */
const unsigned char RobotisRX28::P_GOAL_POSITION_H        = 31; /**< P_GOAL_POSITION_H */
const unsigned char RobotisRX28::P_GOAL_SPEED_L           = 32; /**< P_GOAL_SPEED_L */
const unsigned char RobotisRX28::P_GOAL_SPEED_H           = 33; /**< P_GOAL_SPEED_H */
const unsigned char RobotisRX28::P_TORQUE_LIMIT_L         = 34; /**< P_TORQUE_LIMIT_L */
const unsigned char RobotisRX28::P_TORQUE_LIMIT_H         = 35; /**< P_TORQUE_LIMIT_H */
const unsigned char RobotisRX28::P_PRESENT_POSITION_L     = 36; /**< P_PRESENT_POSITION_L */
const unsigned char RobotisRX28::P_PRESENT_POSITION_H     = 37; /**< P_PRESENT_POSITION_H */
const unsigned char RobotisRX28::P_PRESENT_SPEED_L        = 38; /**< P_PRESENT_SPEED_L */
const unsigned char RobotisRX28::P_PRESENT_SPEED_H        = 39; /**< P_PRESENT_SPEED_H */
const unsigned char RobotisRX28::P_PRESENT_LOAD_L         = 40; /**< P_PRESENT_LOAD_L */
const unsigned char RobotisRX28::P_PRESENT_LOAD_H         = 41; /**< P_PRESENT_LOAD_H */
const unsigned char RobotisRX28::P_PRESENT_VOLTAGE        = 42; /**< P_PRESENT_VOLTAGE */
const unsigned char RobotisRX28::P_PRESENT_TEMPERATURE    = 43; /**< P_PRESENT_TEMPERATURE */
const unsigned char RobotisRX28::P_REGISTERED_INSTRUCTION = 44; /**< P_REGISTERED_INSTRUCTION */
const unsigned char RobotisRX28::P_PAUSE_TIME             = 45; /**< P_PAUSE_TIME */
const unsigned char RobotisRX28::P_MOVING                 = 46; /**< P_MOVING */
const unsigned char RobotisRX28::P_LOCK                   = 47; /**< P_LOCK */
const unsigned char RobotisRX28::P_PUNCH_L                = 48; /**< P_PUNCH_L */
const unsigned char RobotisRX28::P_PUNCH_H                = 49; /**< P_PUNCH_H */

//--- Instructions ---
const unsigned char RobotisRX28::INST_PING                = 0x01; /**< INST_PING */
const unsigned char RobotisRX28::INST_READ                = 0x02; /**< INST_READ */
const unsigned char RobotisRX28::INST_WRITE               = 0x03; /**< INST_WRITE */
const unsigned char RobotisRX28::INST_REG_WRITE           = 0x04; /**< INST_REG_WRITE */
const unsigned char RobotisRX28::INST_ACTION              = 0x05; /**< INST_ACTION */
const unsigned char RobotisRX28::INST_RESET               = 0x06; /**< INST_RESET */
const unsigned char RobotisRX28::INST_DIGITAL_RESET       = 0x07; /**< INST_DIGITAL_RESET */
const unsigned char RobotisRX28::INST_SYSTEM_READ         = 0x0C; /**< INST_SYSTEM_READ */
const unsigned char RobotisRX28::INST_SYSTEM_WRITE        = 0x0D; /**< INST_SYSTEM_WRITE */
const unsigned char RobotisRX28::INST_SYNC_WRITE          = 0x83; /**< INST_SYNC_WRITE */
const unsigned char RobotisRX28::INST_SYNC_REG_WRITE      = 0x84; /**< INST_SYNC_REG_WRITE */

const unsigned char RobotisRX28::PACKET_OFFSET_ID         = 2; /**< PACKET_OFFSET_ID */
const unsigned char RobotisRX28::PACKET_OFFSET_LENGTH     = 3; /**< PACKET_OFFSET_LENGTH */
const unsigned char RobotisRX28::PACKET_OFFSET_INST       = 4; /**< PACKET_OFFSET_INST */
const unsigned char RobotisRX28::PACKET_OFFSET_PARAM      = 5; /**< PACKET_OFFSET_PARAM */
const unsigned char RobotisRX28::PACKET_OFFSET_ERROR      = 4; /**< PACKET_OFFSET_ERROR */

using namespace std;
using namespace fawkes;


/** @class RobotisRX28 "rx28.h"
 * Class to access a chain of Robotis RX28 servos.
 * One instance of this class communicates with a chain of up to 254 Robotis
 * RX28 servos, which are uniquely identified with an ID. Before making use of
 * the chain, connect each servo individually and set its ID. See the
 * discover() method for more information about numbering of the servos.
 * To achieve a higher speed, it is recommended to set the status return level
 * to reply only on READ instructions. You can do this for the whole chain with
 * @code
 * rx28->set_status_return_level(RobotisRX28::BROADCAST_ID, RobotisRX28::SRL_RESPOND_READ);
 * @endcode
 *
 * @author Tim Niemueller
 */


/** Constructor.
 * @param device_file device file of the serial port
 * @param default_timeout_ms the timeout to apply by default to reading operations
 */
RobotisRX28::RobotisRX28(const char *device_file, unsigned int default_timeout_ms)
{
  __default_timeout_ms = default_timeout_ms;
  __device_file        = strdup(device_file);
  __fd                 = -1;
  __obuffer_length     = 0;
  __ibuffer_length     = 0;
  memset(__control_table, 0, RX28_MAX_NUM_SERVOS * RX28_CONTROL_TABLE_LENGTH);
  try {
    open();
  } catch (Exception &e) {
    free(__device_file);
    throw;
  }
}


