fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28.cpp
/** Destructor. */
RobotisRX28::~RobotisRX28()
{
  free(__device_file);
}

/** Open serial port. */
void
RobotisRX28::open() {

  struct termios param;

  __fd = ::open(__device_file, O_CREAT | O_NOCTTY | O_RDWR);
  if (__fd == -1) {
    throw CouldNotOpenFileException(__device_file, errno, "Cannot open device file");
  }

  if (tcgetattr(__fd, &param) == -1) {
    Exception e(errno, "Getting the port parameters failed");
    ::close(__fd);
    __fd = -1;
    throw e;
  }

  cfsetospeed(&param, B57600);
  cfsetispeed(&param, B57600);

  param.c_lflag &= ~(ICANON | ECHO | ECHOE | ECHOK | ECHONL | ISIG | IEXTEN);
  param.c_iflag &= ~(INLCR | IGNCR | ICRNL | IGNBRK | PARMRK);

  // turn off hardware flow control
  param.c_iflag &= ~(IXON | IXOFF | IXANY);
  param.c_cflag &= ~CRTSCTS;

  param.c_cflag |= (CREAD | CLOCAL);
    
  // number of data bits: 8
  param.c_cflag &= ~CS5 & ~CS6 & ~CS7 & ~CS8;
  param.c_cflag |= CS8;
    
  // parity: none
  param.c_cflag &= ~(PARENB | PARODD);
  param.c_iflag &= ~(INPCK | ISTRIP);
    
  // stop bits: 1
  param.c_cflag &= ~CSTOPB;

  //enable raw output
  param.c_oflag &= ~OPOST;

  param.c_cc[VMIN]  = 1;
  param.c_cc[VTIME] = 0;
    
  tcflush(__fd, TCIOFLUSH);

  if (tcsetattr(__fd, TCSANOW, &param) != 0) {
    Exception e(errno, "Setting the port parameters failed");
    ::close(__fd);
    __fd = -1;
    throw e;
  }

  //char junk[1];
  //read(__fd, junk, 1);

#ifdef TIMETRACKER_VISCA
  tracker = new TimeTracker();
  track_file.open("tracker_visca.txt");
  ttcls_pantilt_get_send = tracker->addClass("getPanTilt: send");
  ttcls_pantilt_get_read = tracker->addClass("getPanTilt: read");
  ttcls_pantilt_get_handle = tracker->addClass("getPanTilt: handling responses");
  ttcls_pantilt_get_interpret = tracker->addClass("getPanTilt: interpreting");
#endif

  // success
}


/** Close port. */
void
RobotisRX28::close()
{
  if (__fd >= 0) {
    ::close(__fd);
    __fd = -1;
  }
}


/** Calculate the checksum for the given packet.
 * @param id servo ID
 * @param instruction instruction to send
 * @param params parameters in the message
 * @param plength length of the params array
 * @return checksum as defined in the RX28 manual
 */
unsigned char
RobotisRX28::calc_checksum(const unsigned char id, const unsigned char instruction,
			   const unsigned char *params, const unsigned char plength)
{
  unsigned int checksum = id + instruction + plength+2;
  for (unsigned char i = 0; i < plength; ++i) {
    checksum += params[i];
  }

  return ~(checksum & 0xFF);
}


/** Send instruction packet.
 * @param id servo ID
 * @param instruction instruction to send
 * @param params parameters in the message
 * @param plength length of the params array
 */
void
RobotisRX28::send(const unsigned char id, const unsigned char instruction,
		  const unsigned char *params, const unsigned char plength)
{
  // Byte 0 and 1 must be 0xFF
  __obuffer[0] = 0xFF;
  __obuffer[1] = 0xFF;
  __obuffer[PACKET_OFFSET_ID]     = id;
  __obuffer[PACKET_OFFSET_LENGTH] = plength+2;
  __obuffer[PACKET_OFFSET_INST]   = instruction;

  unsigned int checksum = id + plength+2;

  for (unsigned char i = 0; i < plength; ++i) {
    __obuffer[PACKET_OFFSET_PARAM + i] = params[i];
    checksum += params[i];
  }

  // actually +5, but zero-based array, therefore index 4, but fifth value
  __obuffer[3 + plength+2] = calc_checksum(id, instruction, params, plength);
  __obuffer_length = plength+2 + 4 ; // 4 for 0xFF 0xFF ID LENGTH

  /*
  printf("Sending: ");
  for (int i = 0; i < __obuffer_length; ++i) {
    printf("%X ", __obuffer[i]);
  }
  printf("\n");
  */

  int written = write(__fd, __obuffer, __obuffer_length);
  //printf("Wrote %d bytes\n", written);

  // For some reason we have to read the shit immediately, although ECHO is off
  read(__fd, __ibuffer, __obuffer_length);
  //printf("Read %d bytes\n", readb);

  if ( written < 0 ) {
    throw Exception(errno, "Failed to write RX28 packet %x for %x", instruction, id);
  } else if (written < __obuffer_length) {
    throw Exception("Failed to write RX28 packet %x for %x, only %d of %d bytes sent",
		    instruction, id, written, __obuffer_length);
  }
}


/** Receive a packet.
 * @param timeout_ms maximum wait time in miliseconds
 */
void
RobotisRX28::recv(unsigned int timeout_ms)
{
  timeval timeout = {0, (timeout_ms == 0xFFFFFFFF ? __default_timeout_ms : timeout_ms)  * 1000};

  fd_set read_fds;
  FD_ZERO(&read_fds);
  FD_SET(__fd, &read_fds);

  int rv = 0;
  rv = select(__fd + 1, &read_fds, NULL, NULL, &timeout);

  if ( rv == -1 ) {
   throw Exception(errno, "Select on FD failed");
  } else if ( rv == 0 ) {
    //printf("Timeout, no data :-/\n");
    throw TimeoutException("Timeout reached while waiting for incoming RX28 data");
  }

  __ibuffer_length = 0;

  // get octets one by one
  int bytes_read = 0;
  while (bytes_read < 6) {
    //printf("Trying to read %d bytes\n", 6 - bytes_read);
    bytes_read += read(__fd, __ibuffer + bytes_read, 6 - bytes_read);
    /*
    printf("%d bytes read  ", bytes_read);
    for (int i = 0; i < bytes_read; ++i) {
      printf("%X ", __ibuffer[i]);
    }
    printf("\n");
    */
  }
  if (bytes_read < 6) {
    throw Exception("Failed to read packet header");
  }
  unsigned char plength = __ibuffer[PACKET_OFFSET_LENGTH] - 2;
  //printf("header read, params have length %d\n", plength);
  if (plength > 0) {
    bytes_read = 0;
    while (bytes_read < plength) {
      bytes_read += read(__fd, &__ibuffer[6] + bytes_read, plength - bytes_read);
    }
    if (bytes_read < plength) {
      throw Exception("Failed to read packet data");
    }
  }

  __ibuffer_length = plength+2 + 4;
  /*
  printf("Read: ");
  for (int i = 0; i < __ibuffer_length; ++i) {
    printf("%X ", __ibuffer[i]);
  }
  printf("\n");
  */

  // verify checksum
  unsigned char checksum = calc_checksum(__ibuffer[PACKET_OFFSET_ID],
					 __ibuffer[PACKET_OFFSET_INST],
					 &__ibuffer[PACKET_OFFSET_PARAM], plength);
  if (checksum != __ibuffer[plength + 5]) {
    throw Exception("Checksum error while receiving packeg, expected %d, got %d",
		    checksum, __ibuffer[plength + 5]);
  }

