fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28.cpp
  __ibuffer_length = plength+2 + 4;
}


/** Check data availability.
 * @return true if data is available, false otherwise
 */
bool
RobotisRX28::data_available()
{
  int num_bytes = 0;
  ioctl(__fd, FIONREAD, &num_bytes);
  return (num_bytes > 0);
}


/** Discover devices on the bus.
 * This method will send a PING instruction to the broadcast ID and collect
 * responses. This assumes that the return delay time is set appropriately that
 * all responses can be received without collisions, and that the difference
 * between the time of two consecutive servos is smaller than the given timeout
 * (note that this might be void if you have one servo with ID 1 and one with
 * ID 253). After sending the packet this method will do up to
 * RX28_MAX_NUM_SERVOS receive operations, each with the given timeout. After the
 * first timeout the discovery is aborted assuming that all replies have been
 * received. You can set the timeout really high (several seconds) to be sure
 * that all connected servos are recognized.
 * For this to work best it is recommended to set consecutive servo IDs starting
 * from 1 on the servos.
 * After the servos are found, the control tables of all recognized servos are
 * received to ensure that all other methods return valid data.
 * @param timeout_ms maximum timeout to wait for replies.
 * @return list of detected servo IDs
 */
RobotisRX28::DeviceList
RobotisRX28::discover(unsigned int timeout_ms)
{
  DeviceList rv;

  // simply re-throw exception upwards
  send(BROADCAST_ID, INST_PING, NULL, 0);

  for (unsigned int i = 0; i < RX28_MAX_NUM_SERVOS; ++i) {
    try {
      recv(timeout_ms);
      rv.push_back(__ibuffer[PACKET_OFFSET_ID]);
    } catch (TimeoutException &e) {
      // the first timeout, no more devices can be expected to respond
      break;
    }
  }

  // now get data about all servos
  for (DeviceList::iterator i = rv.begin(); i != rv.end(); ++i) {
    try {
      read_table_values(*i);
    } catch (Exception &e) {
      e.append("Failed to receive control table for servo %u", *i);
      throw;
    }
  }
 
  return rv;
}


/** Ping servo.
 * This pings the given servo by sending a PING instruction and
 * reading the reply.
 * @param id servo ID, not the broadcast ID
 * @param timeout_ms maximum wait time in miliseconds
 */
bool
RobotisRX28::ping(unsigned char id, unsigned int timeout_ms)
{
  assert_valid_id(id);
  try {
    send(id, INST_PING, NULL, 0);
    recv(timeout_ms);
    return true;
  } catch (Exception &e) {
    e.print_trace();
    return false;
  }
}


/** Read all table values for given servo.
 * This issues a READ comment for the whole control table and waits for the
 * response.
 * @param id servo ID
 */
void
RobotisRX28::read_table_values(unsigned char id)
{
  start_read_table_values(id);
  finish_read_table_values();
}


/** Start to receive table values.
 * This method sends a READ instruction packet for the whole table, but it does
 * not wait for the reply. This can be used to overlap the receiving with other
 * operations. You have to ensure to call finish_read_table_values() before
 * sending any other data.
 * @param id servo ID, not the broadcast ID
 */
void
RobotisRX28::start_read_table_values(unsigned char id)
{
  assert_valid_id(id);
  unsigned char param[2];
  param[0] = 0x00;
  param[1] = RX28_CONTROL_TABLE_LENGTH;

  send(id, INST_READ, param, 2);
}

/** Finish control table receive operations.
 * This executes the receive operation initiated by start_read_table_values().
 * This will read the values and write the output to the control table
 * (in memory, not in the servo), such that the appropriate get methods will
 * return the new data.
 */
void
RobotisRX28::finish_read_table_values()
{
  recv();

  if (__ibuffer_length != 5 + RX28_CONTROL_TABLE_LENGTH + 1) {
    throw Exception("Input buffer of invalid size");
  }
  memcpy(__control_table[__ibuffer[PACKET_OFFSET_ID]],
	 &__ibuffer[PACKET_OFFSET_PARAM], RX28_CONTROL_TABLE_LENGTH);
}


/** Read a table value.
 * This will read the given value(s) and write the output to the control table
 * (in memory, not in the servo), such that the appropriate get method will return
 * the new value.
 * @param id servo ID, not the broadcast ID
 * @param addr start addr, one of the P_* constants.
 * @param read_length number of bytes to read
 */
void
RobotisRX28::read_table_value(unsigned char id,
			      unsigned char addr, unsigned char read_length)
{
  assert_valid_id(id);

  unsigned char param[2];
  param[0] = addr;
  param[1] = read_length;

  send(id, INST_READ, param, 2);
  recv();

  if (__ibuffer_length != (5 + read_length + 1)) {
    throw Exception("Input buffer not of expected size, expected %u, got %u",
		    (5 + read_length + 1), __ibuffer_length);
  }

  for (unsigned int i = 0; i < read_length; ++i) {
    __control_table[id][addr + i] = __ibuffer[PACKET_OFFSET_PARAM + i];
  }
}


/** Write a table value.
 * @param id servo ID, may be the broadcast ID
 * @param addr start addr, one of the P_* constants.
 * @param value value to write
 * @param double_byte if true, will assume value to be a two-byte value, otherwise
 * it is considered as a one-byte value.
 */
void
RobotisRX28::write_table_value(unsigned char id, unsigned char addr,
			       unsigned int value, bool double_byte)
{
  unsigned char param[3];
  param[0] = addr;
  param[1] = value & 0xFF;
  param[2] = (value >> 8) & 0xFF;

  try {
    send(id, INST_WRITE, param, double_byte ? 3 : 2);

    if (id == BROADCAST_ID) {
      for (unsigned int i = 0; i < RX28_MAX_NUM_SERVOS; ++i) {
	__control_table[i][addr] = param[1];
	if (double_byte) __control_table[i][addr + 1] = param[2];
      }
    } else {
      __control_table[id][addr] = param[1];
      if (double_byte) __control_table[id][addr + 1] = param[2];
    }

    if ((id != BROADCAST_ID) && responds_all(id))  recv();
  } catch (Exception &e) {
    e.print_trace();
    throw;
  }
}


/** Write multiple table values.
 * @param id servo ID, may be the broadcast ID
 * @param start_addr start addr, one of the P_* constants.
 * @param values values to write
 * @param num_values length in bytes of the values array
 */
void
RobotisRX28::write_table_values(unsigned char id, unsigned char start_addr,
				unsigned char *values, unsigned int num_values)
{
  unsigned char param[num_values + 1];
  param[0] = start_addr;
  for (unsigned int i = 0; i < num_values; ++i) {
    param[i + 1] = values[i];
  }

