fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28.cpp
  try {
    send(id, INST_WRITE, param, num_values + 1);

    if (id == BROADCAST_ID) {
      for (unsigned int i = 0; i < RX28_MAX_NUM_SERVOS; ++i) {
	for (unsigned int j = 0; j < num_values; ++j) {
	  __control_table[i][start_addr + j] = values[j];
	}
      }
    } else {
      for (unsigned int j = 0; j < num_values; ++j) {
	__control_table[id][start_addr + j] = values[j];
      }
    }

    if ((id != BROADCAST_ID) && responds_all(id))  recv();
  } catch (Exception &e) {
    e.print_trace();
    throw;
  }
}


/** Assert that the ID is valid.
 * @exception Exception thrown if \p id is the broadcast ID
 * @exception OutOfBoundsException thrown if the number is greater than the
 * maximum number of servos.
 */
void
RobotisRX28::assert_valid_id(unsigned char id)
{
  if (id == BROADCAST_ID) {
    throw Exception("Data can only be queried for a specific servo");
  } else if (id >= RX28_MAX_NUM_SERVOS) {
    throw OutOfBoundsException("Servo ID out of bounds", id, 0, RX28_MAX_NUM_SERVOS);
  }
}


/** Merge two values to a two-byte value.
 * @param id servo id, not the broadcast ID
 * @param ind_l low index in control table
 * @param ind_h high index in control table
 */
unsigned int
RobotisRX28::merge_twobyte_value(unsigned int id,
				 unsigned char ind_l, unsigned char ind_h)
{
  unsigned int rv = (__control_table[id][ind_h] & 0xFF) << 8;
  rv |= __control_table[id][ind_l] & 0xFF;
  return rv;
}


/** Get a value from the control table, possibly from servo.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @param ind_l low index in control table
 * @param ind_h high index in control table, only set if value is a
 * two-byte value.
 * @return value
 */
unsigned int
RobotisRX28::get_value(unsigned int id, bool refresh,
		       unsigned int ind_l, unsigned int ind_h)
{
  assert_valid_id(id);

  if (refresh)  read_table_value(id, ind_l, (ind_h == 0xFFFFFFFF ? 1 : 2));

  if (ind_h == 0xFFFFFFFF) {
    return __control_table[id][ind_l];
  } else {
    return merge_twobyte_value(id, ind_l, ind_h);
  }
}

/** Get model.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return model
 */
unsigned int
RobotisRX28::get_model(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_MODEL_NUMBER_L, P_MODEL_NUMBER_H);
}


/** Get current position.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return current position
 */
unsigned int
RobotisRX28::get_position(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_PRESENT_POSITION_L, P_PRESENT_POSITION_H);
}


/** Get firmware version.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return firmware version
 */
unsigned char
RobotisRX28::get_firmware_version(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_VERSION);
}


/** Get baud rate.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return baud rate
 */
unsigned char
RobotisRX28::get_baudrate(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_BAUD_RATE);
}


/** Get time of the delay before replies are sent.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return delay time
 */
unsigned char
RobotisRX28::get_delay_time(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_RETURN_DELAY_TIME);
}


/** Get angle limits.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @param cw_limit upon return contains the clockwise angle limit
 * @param ccw_limit upon return contains the counter-clockwise angle limit
 */
void
RobotisRX28::get_angle_limits(unsigned char id,
			      unsigned int &cw_limit, unsigned int &ccw_limit,
			      bool refresh)
{
  cw_limit  = get_value(id, refresh, P_CW_ANGLE_LIMIT_L, P_CW_ANGLE_LIMIT_H);
  ccw_limit = get_value(id, refresh, P_CCW_ANGLE_LIMIT_L, P_CCW_ANGLE_LIMIT_H);
}


/** Get temperature limit.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return temperature limit.
 */
unsigned char
RobotisRX28::get_temperature_limit(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_LIMIT_TEMPERATURE);
}


/** Get voltage limits.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @param low upon return contains low voltage limit
 * @param high upon return contans high voltage limit
 */
void
RobotisRX28::get_voltage_limits(unsigned char id,
			      unsigned char &low, unsigned char &high,
			      bool refresh)
{
  low  = get_value(id, refresh, P_DOWN_LIMIT_VOLTAGE);
  high = get_value(id, refresh, P_UP_LIMIT_VOLTAGE);
}


/** Get maximum torque.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return maximum torque
 */
unsigned int
RobotisRX28::get_max_torque(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_MAX_TORQUE_L, P_MAX_TORQUE_H);
}


/** Get status return level.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return status return level
 */
unsigned char
RobotisRX28::get_status_return_level(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_RETURN_LEVEL);
}


/** Get alarm LED status.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return alarm LED status.
 */
unsigned char
RobotisRX28::get_alarm_led(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_ALARM_LED);
}


/** Get shutdown on alarm state.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return shutdown on alarm state
 */
unsigned char
RobotisRX28::get_alarm_shutdown(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_ALARM_SHUTDOWN);
}


/** Get calibration data.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @param down_calib downward calibration
 * @param up_calib upward calibration
 */
void
RobotisRX28::get_calibration(unsigned char id,
			     unsigned int &down_calib, unsigned int &up_calib,
			     bool refresh)
{
  down_calib = get_value(id, refresh, P_DOWN_CALIBRATION_L, P_DOWN_CALIBRATION_H);
  up_calib   = get_value(id, refresh, P_UP_CALIBRATION_L, P_UP_CALIBRATION_H);
}


/** Check if torque is enabled
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return true if torque is enabled, false otherwise
 */
bool
RobotisRX28::is_torque_enabled(unsigned char id, bool refresh)
{
  return (get_value(id, refresh, P_TORQUE_ENABLE) == 1);
}


/** Check if LED is enabled
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return true if led is enabled, false otherwise.
 */
bool
RobotisRX28::is_led_enabled(unsigned char id, bool refresh)
{
  return (get_value(id, refresh, P_LED) == 1);
}


/** Get compliance values.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @param cw_margin upon return contains clockwise margin
 * @param cw_slope upon return contains clockwise slope
 * @param ccw_margin upon return contains counter-clockwise margin
 * @param ccw_slope upon return contains counter-clockwise slope
 */
void
RobotisRX28::get_compliance_values(unsigned char id,
				   unsigned char &cw_margin, unsigned char &cw_slope,
				   unsigned char &ccw_margin, unsigned char &ccw_slope,
				   bool refresh)
{
  cw_margin  = get_value(id, refresh, P_CW_COMPLIANCE_MARGIN);
  cw_slope   = get_value(id, refresh, P_CW_COMPLIANCE_SLOPE);
  ccw_margin = get_value(id, refresh, P_CCW_COMPLIANCE_MARGIN);
  ccw_slope  = get_value(id, refresh, P_CCW_COMPLIANCE_SLOPE);
}


/** Get goal position.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return goal position
 */
unsigned int
RobotisRX28::get_goal_position(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_GOAL_POSITION_L, P_GOAL_POSITION_H);
}


/** Get goal speed.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return goal speed
 */
unsigned int
RobotisRX28::get_goal_speed(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_GOAL_SPEED_L, P_GOAL_SPEED_H);
}


/** Get maximum supported speed.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return maximum supported speed in rad/s
 */
float
RobotisRX28::get_max_supported_speed(unsigned char id, bool refresh)
{
  float voltage = get_voltage(id, refresh) / 10.0;

