fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28.cpp
  if ((voltage < 12.0) || (voltage > 16.0)) {
    throw OutOfBoundsException("Voltage is outside of specs", voltage, 12.0, 16.0);
  }

  float sec_per_deg_12V = SEC_PER_60DEG_12V / 60.0;
  float sec_per_deg_16V = SEC_PER_60DEG_16V / 60.0;

  float range_sec_per_deg = sec_per_deg_12V - sec_per_deg_16V;
  float pos = voltage - 12.0;

  float sec_per_deg = sec_per_deg_16V + pos * range_sec_per_deg;
  float deg_per_sec = 1.0 / sec_per_deg;

  return deg2rad(deg_per_sec);
}


/** Get torque limit.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return torque limit
 */
unsigned int
RobotisRX28::get_torque_limit(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_TORQUE_LIMIT_L, P_TORQUE_LIMIT_H);
}


/** Get current speed.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return current speed
 */
unsigned int
RobotisRX28::get_speed(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_PRESENT_SPEED_L, P_PRESENT_SPEED_H);
}


/** Get current load.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return current load
 */
unsigned int
RobotisRX28::get_load(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_PRESENT_LOAD_L, P_PRESENT_LOAD_H);
}


/** Get current voltage.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return voltage, divide by 10 to get V
 */
unsigned char
RobotisRX28::get_voltage(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_PRESENT_VOLTAGE);
}


/** Get temperature.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return temperature in degrees Celsius
 */
unsigned char
RobotisRX28::get_temperature(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_PRESENT_TEMPERATURE);
}


/** Check if servo is moving.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return true if servo is moving, false otherwise
 */
bool
RobotisRX28::is_moving(unsigned char id, bool refresh)
{
  return (get_value(id, refresh, P_MOVING) == 1);
}


/** Check is servo is locked.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return true if servo config is locked, false otherwise
 */
bool
RobotisRX28::is_locked(unsigned char id, bool refresh)
{
  return (get_value(id, refresh, P_LOCK) == 1);
}


/** Get punch.
 * @param id servo ID, not the broadcast ID
 * @param refresh if true, will issue a read command for the value
 * @return punch
 */
unsigned int
RobotisRX28::get_punch(unsigned char id, bool refresh)
{
  return get_value(id, refresh, P_PUNCH_L, P_PUNCH_H);
}


/** Set ID.
 * @param id servo ID
 * @param new_id new ID to set
 */
void
RobotisRX28::set_id(unsigned char id, unsigned char new_id)
{
  write_table_value(id, P_ID, new_id);
}


/** Set baud rate.
 * @param id servo ID
 * @param baudrate new baudrate
 */
void
RobotisRX28::set_baudrate(unsigned char id, unsigned char baudrate)
{
  write_table_value(id, P_BAUD_RATE, baudrate);
}


/** Set return delay time.
 * @param id servo ID
 * @param return_delay_time new return delay time
 */
void
RobotisRX28::set_return_delay_time(unsigned char id, unsigned char return_delay_time)
{
  write_table_value(id, P_RETURN_DELAY_TIME, return_delay_time);
}


/** Set angle limits.
 * @param id servo ID
 * @param cw_limit new clockwise limit
 * @param ccw_limit new counter-clockwise limit
 */
void
RobotisRX28::set_angle_limits(unsigned char id,
			      unsigned int cw_limit, unsigned int ccw_limit)
{
  write_table_value(id, P_CW_ANGLE_LIMIT_L, cw_limit, true);
  write_table_value(id, P_CCW_ANGLE_LIMIT_L, ccw_limit, true);
}


/** Set temperature limit.
 * @param id servo ID
 * @param temp_limit new temperature limit (in degrees Celsius)
 */
void
RobotisRX28::set_temperature_limit(unsigned char id, unsigned char temp_limit)
{
  write_table_value(id, P_LIMIT_TEMPERATURE, temp_limit);
}


/** Set voltage limits.
 * @param id servo ID
 * @param low lower bound (give Volts * 10)
 * @param high higher bound (give Volts * 10)
 */
void
RobotisRX28::set_voltage_limits(unsigned char id, unsigned char low, unsigned char high)
{
  unsigned char param[2];
  param[0] = low;
  param[1] = high;
  write_table_values(id, P_DOWN_LIMIT_VOLTAGE, param, 2);
}


/** Set maximum torque.
 * @param id servo ID
 * @param max_torque new maximum torque
 */
void
RobotisRX28::set_max_torque(unsigned char id, unsigned int max_torque)
{
  write_table_value(id, P_MAX_TORQUE_L, max_torque, true);
}


/** Set status return level
 * @param id servo ID
 * @param status_return_level status return level, one of SRL_RESPOND_NONE,
 * SRL_RESPOND_READ or SRL_RESPOND_ALL.
 */
void
RobotisRX28::set_status_return_level(unsigned char id, unsigned char status_return_level)
{
  write_table_value(id, P_RETURN_LEVEL, status_return_level);
}


/** Set alarm LED settings.
 * @param id servo ID
 * @param alarm_led new LED alarm value.
 */
void
RobotisRX28::set_alarm_led(unsigned char id, unsigned char alarm_led)
{
  write_table_value(id, P_ALARM_LED, alarm_led);
}


/** Set shutdown on alarm.
 * @param id servo ID
 * @param alarm_shutdown alarm shutdown settings
 */
void
RobotisRX28::set_alarm_shutdown(unsigned char id, unsigned char alarm_shutdown)
{
  write_table_value(id, P_ALARM_SHUTDOWN, alarm_shutdown);
}


/** Enable or disable torque.
 * @param id servo ID
 * @param enabled true to enable (servo is powered) false to disable
 * (servo power disabled, servo can be freely moved manually)
 */
void
RobotisRX28::set_torque_enabled(unsigned char id, bool enabled )
{
  write_table_value(id, P_TORQUE_ENABLE, enabled ? 1 : 0);
}


/** Enable or disable torque for multiple (selected) servos at once.
 * Given the number of servos the same number of variadic arguments must be
 * passed, one for each servo ID that should be enabled/disabled.
 * @param enabled true to enable (servo is powered) false to disable
 * (servo power disabled, servo can be freely moved manually)
 * @param num_servos number of servos to set, maximum is 120
 */
void
RobotisRX28::set_torques_enabled(bool enabled, unsigned char num_servos, ...)
{
  if (num_servos > 120) {
    // not enough space for everything in the parameters..
    throw Exception("You cannot set more than 120 servos at once");
  }

  va_list arg;
  va_start(arg, num_servos);

  unsigned int  plength = 2 * num_servos + 2;
  unsigned char param[plength];
  param[0] = P_TORQUE_ENABLE;
  param[1] = 1;
  for (unsigned int i = 0; i < num_servos; ++i) {
    unsigned char id    = va_arg(arg, unsigned int);
    param[2 + i * 2] = id;
    param[2 + i * 2 + 1] = enabled ? 1 : 0;
  }
  va_end(arg);

