fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28.cpp
  send(BROADCAST_ID, INST_SYNC_WRITE, param, plength);
}


/** Turn LED on or off.
 * @param id servo ID
 * @param led_enabled true to turn LED on, false to turn off
 */
void
RobotisRX28::set_led_enabled(unsigned char id, bool led_enabled )
{
  write_table_value(id, P_LED, led_enabled ? 1 : 0);
}


/** Set compliance values.
 * @param id servo ID
 * @param cw_margin clockwise margin
 * @param cw_slope clockwise slope
 * @param ccw_margin counter-clockwise margin
 * @param ccw_slope counter-clockwise slope
 */
void
RobotisRX28::set_compliance_values(unsigned char id,
				   unsigned char cw_margin, unsigned char cw_slope,
				   unsigned char ccw_margin, unsigned char ccw_slope)
{
  unsigned char param[4];
  param[0] = cw_margin;
  param[1] = ccw_margin;
  param[2] = cw_slope;
  param[3] = ccw_slope;
  write_table_values(id, P_CW_COMPLIANCE_MARGIN, param, 4);
}


/** Set goal speed.
 * @param id servo ID
 * @param goal_speed desired goal speed, 1024 is maximum, 0 means "no velicity
 * control", i.e. move as fast as possible depending on the voltage
 */
void
RobotisRX28::set_goal_speed(unsigned char id, unsigned int goal_speed)
{
  write_table_value(id, P_GOAL_SPEED_L, goal_speed, true);
}


/** Set goal speeds for multiple servos.
 * Given the number of servos the variadic arguments must contain two values
 * for each servo, first is the ID, second the value.
 * @param num_servos number of servos, maximum is 83
 */
void
RobotisRX28::set_goal_speeds(unsigned int num_servos, ...)
{
  if (num_servos > 83) {
    // not enough space for everything in the parameters..
    throw Exception("You cannot set more than 83 speeds at once");
  }

  va_list arg;
  va_start(arg, num_servos);

  unsigned int  plength = 3 * num_servos + 2;
  unsigned char param[plength];
  param[0] = P_GOAL_SPEED_L;
  param[1] = 2;
  for (unsigned int i = 0; i < num_servos; ++i) {
    unsigned char id    = va_arg(arg, unsigned int);
    unsigned int  value = va_arg(arg, unsigned int);
    printf("Servo speed %u to %u\n", id, value);
    param[2 + i * 3] = id;
    param[2 + i * 3 + 1] = (value & 0xFF);
    param[2 + i * 3 + 2] = (value >> 8) & 0xFF;
  }
  va_end(arg);

  send(BROADCAST_ID, INST_SYNC_WRITE, param, plength);
}


/** Set torque limit.
 * @param id servo ID
 * @param torque_limit new torque limit
 */
void
RobotisRX28::set_torque_limit(unsigned char id, unsigned int torque_limit)
{
  write_table_value(id, P_TORQUE_LIMIT_L, torque_limit, true);
}


/** Set punch.
 * @param id servo ID
 * @param punch new punch value
 */
void
RobotisRX28::set_punch(unsigned char id, unsigned int punch)
{
  write_table_value(id, P_PUNCH_L, punch, true);
}


/** Lock config.
 * Locks the config, configuration values can no longer be modified until the
 * next power cycle.
 * @param id servo ID
 */
void
RobotisRX28::lock_config(unsigned char id)
{
  write_table_value(id, P_LOCK, 1);
}


/** Move servo to specified position.
 * @param id servo ID
 * @param value position, value between 0 and 1023 (inclusive), covering
 * an angle range from 0 to 300 degrees.
 */
void
RobotisRX28::goto_position(unsigned char id, unsigned int value)
{
  write_table_value(id, P_GOAL_POSITION_L, value, true);
}


/** Move several servos to specified positions.
 * Given the number of servos the variadic arguments must contain two values
 * for each servo, first is the ID, second the position (see goto_position() for
 * information on the valid values).
 * @param num_servos number of servos, maximum is 83
 */
void
RobotisRX28::goto_positions(unsigned int num_servos, ...)
{
  if (num_servos > 83) {
    // not enough space for everything in the parameters..
    throw Exception("You cannot set more than 83 servos at once");
  }

  va_list arg;
  va_start(arg, num_servos);

  unsigned int  plength = 3 * num_servos + 2;
  unsigned char param[plength];
  param[0] = P_GOAL_POSITION_L;
  param[1] = 2;
  for (unsigned int i = 0; i < num_servos; ++i) {
    unsigned char id    = va_arg(arg, unsigned int);
    unsigned int  value = va_arg(arg, unsigned int);
    param[2 + i * 3] = id;
    param[2 + i * 3 + 1] = (value & 0xFF);
    param[2 + i * 3 + 2] = (value >> 8) & 0xFF;
  }
  va_end(arg);

  send(BROADCAST_ID, INST_SYNC_WRITE, param, plength);
}

